{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "activation": "linear", "batch_input_shape": [null, 28, 28, 1], "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_1", "bias": true, "input_dtype": "float32", "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "trainable": true, "b_regularizer": null, "nb_filter": 32}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "activation": "linear", "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_2", "bias": true, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "trainable": true, "nb_filter": 32}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "output_dim": 128, "activation": "linear", "input_dim": 4608, "name": "dense_1", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "output_dim": 46, "activation": "linear", "input_dim": 128, "name": "dense_2", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "softmax", "trainable": true}}]}