{"keras_version": "1.2.0", "config": [{"config": {"nb_col": 3, "b_constraint": null, "batch_input_shape": [null, 28, 28, 1], "dim_ordering": "tf", "b_regularizer": null, "nb_filter": 32, "name": "convolution2d_1", "init": "glorot_uniform", "input_dtype": "float32", "W_regularizer": null, "activation": "linear", "nb_row": 3, "trainable": true, "bias": true, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "nb_filter": 40, "name": "convolution2d_2", "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "nb_row": 3, "trainable": true, "bias": true, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "output_dim": 128, "input_dim": 5760, "name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "output_dim": 46, "input_dim": 128, "name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_4", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}