{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 32, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dtype": "float32", "W_constraint": null, "nb_row": 3, "name": "convolution2d_1", "activation": "linear", "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "batch_input_shape": [null, 28, 28, 1], "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 32, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "nb_row": 3, "name": "convolution2d_2", "activation": "linear", "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 128, "activation": "linear", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 4608, "b_constraint": null, "name": "dense_1", "W_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"output_dim": 46, "activation": "linear", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 128, "b_constraint": null, "name": "dense_2", "W_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}}], "keras_version": "1.2.0"}